SELECT USER
FROM DUAL;
--==>> HR


--------------------------------------------------------------------------------

--■■■ 정규화(Normalization) ■■■---
--@ ※ 중요한 개념! 그리고 개인적으로 공부하려고 보면 많이 까다로운 개념임
--@ 집중해서 듣기.....!! 
--@ 우리 수업 관통하는 개념... '나누는 것'
--@ 자바에서 클래스를 여러개 사용하듯이, 오라클에서도 테이블을 나눔

--○ 정규화란?
--@ 나누고 분리하고 쪼개는 것. 간단히 보자면!ㅋㅋ
--   한 마디로... 데이터베이스 서버의 메모리 낭비를 막기 위해
--   어떤 하나의 테이블을... 식별자를 가지는 여러 개의 테이블로
--   나누는(분리하는, 쪼개는) 과정을 말한다.

--@ 너무 작게 나누면 어떤 조각인지 모르니까..식별자 있게!
--@ 퍼즐 조각을 가위로 자르는데 뒤에 숫자 적어놓음. 다시 쉽게 합칠수 있게...이게 식별자! 
--@ 자(~er) : ~하는 사람, 도구, 문자, 장치..... 식별자: 식별할 수 있게 해주는 이런 것들













